

 <?php
 /**
 *待完成任务需要实现的效果   根据效果选择需要使用的功能组件或者对象  效果实现了之后 根据自己的意愿还有设计进行排版布局优化
 *既然要先实现功能那么对于这些功能模块最好要模块化方便调用 代码复用
 *这样对方法设计上，参数选择上还有对象的设计上尤为重要
 *php require (是不是通过require实现类似对象的设计，有待研究)
 *node.js
 *大体上所有的功能都是相通的，切不可且行且扩展 工程架构非常重要
 *不但编程对于其他事情也是这样，目的性要强，善于利用模块化的社会功能实现自己的需求
 */
 ?>

 <html>
 <head>
 	<meta charset="utf-8">
 	<style type="text/css">
 		p:nth-child(2n+1){
 			-webkit-columns:200px 3;
 			-webkit-column-gap:3em;
 			-webkit-column-rule:2px dashed blue;
 		}
 	</style>
 </head>
 <body>
 	<p>我想说的</p>
 	<p>待完成任务需要实现的效果   根据效果选择需要使用的功能组件或者对象  效果实现了之后 根据自己的意愿还有设计进行排版布局优化</p>
 	<p>既然要先实现功能那么对于这些功能模块最好要模块化方便调用 代码复用</p>
 	<p>这样对方法设计上，参数选择上还有对象的设计上尤为重要</p>
 	<p>php require (是不是通过require实现类似对象的设计，有待研究)</p>
 	<p>大体上所有的功能都是相通的，切不可且行且扩展 工程架构非常重要</p>
 	<p>不但编程对于其他事情也是这样，目的性要强，善于利用模块化的社会功能实现自己的需求</p>
 </body>
 	
 </html>